{
  "schema": "GDELT-like (simplified)",
  "event_count": 78,
  "events": [
    {
      "GlobalEventID": "445b8634611be7f7",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Wall Street Journal published this exclusive story on January 25th, stating that “China’s senior-most general is accused of leaking information about the country’s nuclear-weapons program to the U.S. and accepting bribes for official acts, including the promotion of an officer to defense minister, said people familiar with a high-level briefing on the allegations. The briefing — attended on Saturday morning by some of the military’s highest-ranking officers — came just before China’s Ministry of National Defense made the bombshell announcement of an investigation into Gen. Zhang Youxia, once considered Chinese leader Xi Jinping’s most-trusted military ally. That statement gave few details beyond a probe of severe violations of party discipline and state laws.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 4
    },
    {
      "GlobalEventID": "c6572bf92eab9da1",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 26th we published this episode in our Spy Spots series . As per its description, “all airports have a special place in the world of espionage. Even more so, Charles de Gaulle (CDG) airport in Paris, France which is European Union’s busiest airport (at the time of this publication) and a key hub for anyone traveling to/from Middle East and Africa. As such, it’s no surprise that there have been numerous cases where CDG played a key role in espionage cases. In this episode of Spy Spots we have a look at four different recent spy-related incidents that took place in this massive European airport.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 5
    },
    {
      "GlobalEventID": "412f40d13fa0ea9a",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 26th that “William Burns, who headed the agency under Joe Biden from 2021 to 2025, gave a talk in the French capital for clients of investment bank Evercore, where he is a senior adviser. The spymaster specifically highlighted the threat China poses to the West.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 6
    },
    {
      "GlobalEventID": "bd0cce65e5c2b813",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Christo Files published this video on January 26th. As per its description, “in 2016, Russia came dangerously close to overthrowing a European government. It almost worked — and hardly anyone noticed. On election day in Montenegro, authorities announced the arrest of 20 men accused of plotting a violent coup: fake police uniforms, armed paramilitaries, a plan to storm parliament, assassinate the prime minister, and install a pro-Russian government. At first, the world laughed it off as political theater. Eight days later, two Russians were arrested with encrypted phones, cash, fake police gear — and links to one of the most dangerous covert units in the Russian military. In this episode of The Christo Files, Christo takes you deep inside the failed 2016 Montenegro coup attempt — and reveals how Russia’s GRU Unit 29155 attempted to orchestrate what would have been one of the most brazen acts of Russian interference in Europe since the Cold War. You’ll see how Christo’s team at Bellingcat and The Insider identified the two mysterious Russian “tourists” as senior GRU operatives, traced their movements across Europe, uncovered their false identities, and exposed the wider network linking Russian intelligence, oligarchs, state-backed think tanks, and religious institutions in a coordinated effort to stop Montenegro from joining NATO.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 7
    },
    {
      "GlobalEventID": "851cfcd3fa4f2f75",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Ukraine’s Security Service (SBU) announced on January 26th that they “detained another Russian informant in Mykolaiv Oblast. He turned out to be a 21-year-old serviceman of one of the air defence units of the Armed Forces of Ukraine recruited by the enemy. As the investigation established, the person involved in leaking data of the air defence system near the operational airfields of the Ukrainian troops to the Russian Federation. In particular, it is documented how during an air alert, the informant, while on duty, recorded a monitor with secret software on the phone’s camera. He also gave the enemy data on the departure directions of the Armed Forces aviation and the combat positions of Ukrainian air defence units. With the help of intelligence, the Rashists hoped to hit the airfields of the Defence Forces, bypassing the radar stations and mobile fire groups. However, SBU officers worked ahead of schedule and detained the informant immediately after the first communication session with the occupiers. At the same time, comprehensive measures were taken to secure the positions of Ukrainian troops. It was established that the figure came into the field of view of the Russian intelligence services when he wrote pro-Kremlin comments on Telegram channels. During the searches, a smartphone with evidence of work in the Russian Federation was seized from him.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 8
    },
    {
      "GlobalEventID": "c271e22ee3181ca5",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Taipei Times reported on January 27th that “a former Executive Yuan official and another man were indicted yesterday for their alleged involvement in a 2021 espionage case. Cheng Ming-chia (鄭明嘉) is suspected of recruiting retired Executive Yuan official Hu Peng-nian (胡鵬年) to help enlist active-duty and retired military personnel, and target young people engaged in politics across party lines, the Criminal Investigation Bureau said yesterday in a statement. The two were indicted yesterday by the Taiwan High Prosecutors’ Office under the National Security Act (國家安全法). Prosecutors said they are seeking a sentence of at least 10 years in prison for Cheng. Hu was allegedly instructed by the Chinese Communist Party (CCP) to recruit active and retired military personnel, to collect military secrets and target young members of political parties who had recently entered politics. This was done with the aim of obtaining internal communications and classified information from parties, government agencies and representative bodies at all levels, the statement said. The focus on young political workers showed a shift in the tactics of the CCP, which traditionally focused on recruiting people who had access to military secrets, particularly active-duty and retired military personnel, the bureau said. It appears the CCP now hopes to embed recruited operatives within Taiwan’s parties, government agencies and representative institutions to probe for and collect sensitive information of a political nature, it said.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 9
    },
    {
      "GlobalEventID": "ca3c9a6e12f5edce",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Record reported on January 26th that “Google has agreed to pay $68 million to settle a class-action lawsuit alleging its voice-activated assistant illegally recorded and shared the plaintiffs’ private conversations with third parties without their consent. A preliminary settlement agreement was filed Friday in a Northern California federal court and still requires a judge’s approval. Plaintiffs had alleged that when Google Assistant was triggered, the tech giant began recording their words and then disclosed them to third parties in order to sell targeted advertising. Google Assistant engages when users say “Hey Google.” The plaintiffs alleged that they received targeted ads after Google Assistant misheard them and improperly triggered Assistant. The settlement funds will be distributed to people who bought Google devices since May 2016.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 10
    },
    {
      "GlobalEventID": "f2f6f5ee9f33c192",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intel News reported on January 26th that “intelligence partners in the North Atlantic Treaty Organization (NATO) are “not talking openly” anymore, while authorities in Denmark have advised government officials to disable Bluetooth functions on their devices due to spying concerns. According to reports in British news outlets, intelligence-sharing functions inside NATO are at a breaking point following a series of actions by the United States that one source described as “alliance-breaking moves” that could “thoroughly alter the global order for decades to come”. One British outlet cited an unnamed “senior NATO insider” who said that the current dispute between the US and Europe over Greenland is “creating tensions and distrust between European and US colleagues in NATO”. The source added that European and Canadian NATO staff are “not talking openly” with their US counterparts amid “growing concerns that information will make its way back to [US President Donald] Trump”. At the same time, reports from the US suggest that the White House has ordered the Pentagon to “scale back” its participation from NATO’s force structure and a number of transnational advisory groups. European and Canadian military officials are reportedly interpreting these moves as “the latest sign of the Trump administration’s drive to scale back the US military presence in Europe”. Meanwhile, the Danish government has issued multiple advisories to its military and civilian officials to disable all Bluetooth functions across both government-supplied and personal electronic devices, reportedly over concerns of intensified foreign surveillance targeting Denmark. The Danish Defense Intelligence Service (DDIS) issued an advisory to military personnel across Denmark and Greenland to deactivate all Bluetooth functions.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 11
    },
    {
      "GlobalEventID": "236c74965c33b2e7",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "India Tribune reported on January 26th that “Operation Sindoor has forced a major shift in the national security planning of Pakistan. The ISI, which is considered to be one of the most lethal spy agencies in the world, was caught napping during the operation, when several terror launch pads and other infrastructure were hit hard by the Indian armed forces. The failure of the ISI to detect the operation has turned out to be an embarrassment for the agency. An official said that this was largely because, in a fast changing world, the ISI has still been following the age-old human Intelligence formula. There was very little upgrade on digital capabilities, the official added. Another official said that the ISI is making a shift from human to technology-drive Intelligence. The gaps in the manner in which the ISI functions were exposed by the Indian armed forces, the official added. Following the operation, a detailed assessment was carried out by the ISI and other agencies in Pakistan. It was decided that the spending had to increase at any cost. The funds would now be used to enhance digital capabilities. A lot of new technical equipment is being purchased to enhance data-driven monitoring and encrypted communication. Further, the aim is also to reduce dependency on western and Chinese equipment, which the Pakistanis have relied on for years now. An Intelligence Bureau official said that the ISI is in the process of replacing traditional means to gather Intelligence and sense threats. The shift was mandated as the Pakistani agencies were failing to detect threats which were both internal and external. Apart from ‘Operation Sindoor’, the other reasons that mandated this transformation are the internal issues that the country is facing. The Pakistani Army, due to want of proper Intelligence, has been hit hard by the Tehrik-e-Taliban Pakistan (TTP) and the Baloch Nationalist Army (BLA). Officials say that in most attacks, the Pakistan Army looked like sitting ducks and this clearly showed how weak the Intelligence gathering was.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 12
    },
    {
      "GlobalEventID": "7776103da416fad7",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Intercept reported on January 26th that “the Army General nominated to lead the National Security Agency was asked repeatedly this month about how he would use the agency’s vast spying powers. Lt. Gen. Joshua Rudd kept his answers vague. He claimed to know little about a two-decade debate over “backdoor” searches on Americans. He dodged a question about whether the NSA should participate in President Donald Trump’s crackdown on antifa . And when asked about whether he would illegally target Americans, he responded curtly that he would follow the law. The backdoor searches are among one of the most controversial issues about NSA spying. Under current law, the federal government is allowed to search for information on U.S. citizens and residents in the vast troves of communications the NSA has collected while searching for foreign threats. Privacy advocates have long argued that those backdoor searches are a huge privacy violation, pointing to the thousands of times the FBI has misused its backdoor search authority. The government’s authority to conduct such searches expires in April. Rudd said in a written questionnaire that he did not know much about the law that has long dominated headlines about the NSA.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 13
    },
    {
      "GlobalEventID": "49f69e0b0c437a88",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 26th Ukraine’s SBU announced that “according to the evidence base of counter-intelligence and investigators of the Security Service, two agents of Russian military intelligence (better known as GRU), who were detained by the SBU in September 2024 in Zaporizhzhia, received 15 years of imprisonment with confiscation of property. As the investigation established, the attackers were preparing an explosion in a crowded place in Kyiv to provoke panic in the capital of Ukraine. For this, according to the instructions of the handler from the Russian Federation, they purchased the necessary components for the manufacture of a detonating mechanism for a homemade bomb, and then had to combine it with explosives hidden in a cache. According to the investigation, the Russian GRU was ordered by a 20-year-old local resident and her 26-year-old roommate. Both came into the enemy’s sights when looking for «easy earnings» on Telegram channels. After recruitment, agents set fire to several Defence Forces vehicles. Counter-intelligence worked ahead of the curve and delayed the agents during the «test» stage of the task. During the searches, the attackers seized components for the detonating mechanism and other evidence of cooperation with the handler.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 14
    },
    {
      "GlobalEventID": "1457e087a08eb8f0",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Daily Sabah reported on January 26th that “the Netherlands’ military intelligence service has opened multiple investigations into Defense Ministry employees over suspected far-right extremist views, local media reported Monday. The Defense Ministry did not disclose how many individuals are currently being monitored by the Military Intelligence and Security Service (MIVD), the ministry told Dutch online newspaper NU, confirming that multiple investigations have been opened in recent years. A spokesperson for the ministry said the situation has remained consistent for several years. In its annual reports for 2021, 2022, 2023, and 2024, the MIVD reported multiple investigations into employees. In 2019, the Volkskrant newspaper reported that 21 investigations had been launched over the previous five years, leading to the departure of four military personnel linked to far-right extremism. The MIVD decided to investigate right-wing extremism more explicitly in 2020. It is “no surprise” that individuals with right-wing extremist views find their way into the defense ministry, Wieke Vink of the National Coordinator for Security and Counterterrorism (NCTV) told NU.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 15
    },
    {
      "GlobalEventID": "75d911d7c30d7188",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Palestinian Information Centre reported on January 25th that “a high-level delegation from the Hamas Movement met on Saturday with director of the Turkish intelligence agency Ibrahim Kalin in Istanbul. The delegation was led by Khalil al-Hayya, Hamas’s chief in the Gaza Strip, and included senior officials Zaher Jabarin, Mahmoud Mardawi, and Mousa Akkari. The Hamas delegation discussed with Kalin the second phase of the ceasefire agreement in the Gaza Strip, and the need for the Israeli occupation regime to fulfill the requirements of the first phase. According to a statement released by Hamas, both sides agreed to maintain consultation and joint coordination on matters of concern to the Palestinians in the Gaza Strip, especially with regard to the opening of the Rafah border crossing in both directions. The delegation conveyed the Movement’s appreciation to Turkish president Recep Erdogan for his efforts to help bring an end to the war on Gaza. Last Friday, Hamas called on the US-formed board of peace to assume its responsibility to stop Israel’s violations and oblige it to honor its obligations under the ceasefire agreement.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 16
    },
    {
      "GlobalEventID": "67b296fba0e297ec",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Record reported on January 26th that “a London-based critic of the Saudi regime who claimed authorities there hacked his phones with sophisticated spyware has won a court case against the kingdom and was awarded more than £3 million ($4.1 million) in damages. There is a “compelling basis” for concluding that Ghanem Al-Masarir’s iPhones “were hacked by Pegasus spyware which resulted in the exfiltration of data from those mobile phones and that this conduct was directed or authorised by the KSA [Kingdom of Saudi Arabia] or agents acting on its behalf,” said the ruling Monday in the U.K. from Judge Pushpinder Saini. Al-Masarir, 45, has long criticized the Saudi government and had alleged that it hacked two of his phones with Pegasus in June 2018. He also alleged that the regime arranged a 2018 beating in which he sustained eye injuries. Saini entered a summary judgment against Saudi Arabia, which he said has not entered a defense in the case or “engaged in any way with these proceedings” since 2023. “The obvious inference is that the KSA used Pegasus to monitor him over an extended period and by multiple acts,” the judge said. Al-Masarir’s YouTube videos criticizing the Saudi regime have been viewed 345 million times, making him an enemy of a regime that has gone to extreme lengths to silence critics, including by murdering Jamal Khashoggi, a journalist who was slain in the kingdom’s Turkish embassy in October 2018. Saini cited evidence from digital forensic researcher Bill Marczak of The Citizen Lab to justify the ruling. Marczak identified text messages on Al-Masarir’s phones that he said were used to install Pegasus and attributed the infections to the KSA. Al-Masarir said that the hacking of his devices allowed the Saudis to track his location, access all data stored on his phones, use his microphones to record him and turn on the phones’ cameras. The Saudi Embassy in London did not immediately respond to a request for comment.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 17
    },
    {
      "GlobalEventID": "e35f0e8e665c6208",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Telegraph reported on January 26th that “China hacked the mobile phones of senior officials in Downing Street for several years, The Telegraph can disclose. The spying operation is understood to have compromised senior members of the government, exposing their private communications to Beijing. State-sponsored hackers are known to have targeted the phones of some of the closest aides to Boris Johnson, Liz Truss and Rishi Sunak between 2021 and 2024. It is unclear whether the hack included the mobile phones of the prime ministers themselves, but one source with knowledge of the breach said it went “right into the heart of Downing Street”. Intelligence sources in the US indicated that the Chinese espionage operation, known as Salt Typhoon, was ongoing, raising the possibility that Sir Keir Starmer and his senior staff may also have been exposed. MI5 issued an “espionage alert” to Parliament in November about the threat of spying from the Chinese state. Sir Keir departs for China this week — the first visit by a British prime minister since Baroness May in 2018 — to secure trade and investment ties with Beijing. His trip follows the Government’s decision to approve plans for a Chinese mega-embassy in London, which The Telegraph revealed would be located alongside some of the City’s most sensitive communications cables. Critics have accused Labour of jeopardising national security by taking a soft line on hostile Chinese activity in the hope of securing trade deals with the world’s second-largest economy.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 18
    },
    {
      "GlobalEventID": "ffc562a696a669c5",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 27th that “access to encrypted messaging apps is back on the French parliamentary agenda, as are algorithmic intelligence techniques.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 19
    },
    {
      "GlobalEventID": "319d482b5ff4459d",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Ukraine’s SBU announced on January 27th that they “detained another Russian agent in Odesa. The figurehead was engaged in the search and transfer of the coordinates of local sites of the Defence Forces, and later received the task of setting fire to one of them. Thanks to the work of the Main Department of Internal Security of the SBU in advance, he was unable to carry out sabotage. The Security Service also took measures to secure the Defence Forces, whose geolocations were recorded by the adjuster. According to the case materials, the perpetrator turned out to be a 41-year-old unemployed resident of Izmail, who was hiding from mobilisation. The FSB of the Russian Federation recruited him through Telegram channels, where he was looking for «easy earnings». The main task of the enemy agent was to find temporary deployment points of the Defence Forces. These were sites that the Rashists planned to attack from the air. First of all, the person involved was interested in buildings that, in his opinion, could be used by servicemen of the National Guard and the Military Law and Order Service. To collect information, the enemy’s henchman covertly went around the area, photographed potential «targets», marked them on Google Maps and transmitted them to the handler from the FSB through the messenger. Subsequently, the Rashists ordered him to set fire to one of the sites found. However, SBU officers worked ahead of schedule and detained an enemy henchman. During the searches, a mobile phone was seized from him with evidence of correspondence and cooperation with the occupiers.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 20
    },
    {
      "GlobalEventID": "8184e94f57bf2956",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Daily News Hungary reported on January 27th that “a former Czechoslovak intelligence officer arranged a business trip abroad for Áron Orbán, the younger brother of Hungary’s Prime Minister Viktor Orbán, during which he explored potential arms purchases in Czechia and Slovakia. The story, first reported by 444.hu behind a paywall and later summarised by 24.hu , concerns a trip undertaken some six and a half years ago by Áron Orbán, who is 14 years younger than the Prime Minister. According to the reports, he visited weapons and ammunition manufacturers and held discussions on the possible procurement of arms. The trip was organised by a former Czechoslovak spy who is said to have also worked for the Russian KGB and German intelligence services, before later settling in the Hungarian town of Szolnok. According to 444.hu , Mr Orbán openly informed his prospective business partners of his brother’s position in Hungary, while at the same time displaying what the outlet described as a striking lack of basic knowledge about the arms trade.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 21
    },
    {
      "GlobalEventID": "84ba3a47c01d647c",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Times of India reported on January 26th that “hours before the Republic Day celebrations, early Monday morning, Rajasthan’s CID Intelligence agency detained a Pakistani spy on charges of espionage for Pakistan in a major operation in the Sankra police station area of Jaisalmer. The detained youth, around 28 years old, is accused of sending confidential and strategic information related to the Indian Army to Pakistan’s intelligence agency, ISI, for monetary gains since 2024. He is also accused of sending information, videos and photos related to Operation Sindoor to ISI across the border. The suspected spy is being brought to the Central Joint Interrogation Center in Jaipur for further intensive investigation, where security and intelligence agencies are expected to interrogate him. Officials said this is the first accused detained on espionage charges in Jaisalmer this year; last year, 5 Pakistani spies were arrested from Jaisalmer. Rajasthan CID Intelligence Agency Inspector General Vishnukant said the CID Intelligence Rajasthan team was continuously monitoring espionage activities in the state. He said the agency received information that Jabbara Ram, son of Bhanna Ram Meghwal, aged 28, from Nedan village in the Sankra police station area of Jaisalmer district, was in contact with a Pakistani intelligence agency across the border and was sending confidential and strategic information to ISI.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 22
    },
    {
      "GlobalEventID": "459eb4139cec3a11",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Rio Times reported on January 26th that “two ministers say Pegasus infected their phones, suggesting espionage from inside the state. Defense leaders deny owning Pegasus, while police and prosecutors chase competing accounts. A disputed 2021 purchase trail resurfaces, because custody decides responsibility. It began with glitches that felt deliberate. Justice Minister Andrés Idárraga says his iPhone kept losing internet. He says WhatsApp showed read messages as “new” again. He also reported physical surveillance near his routines and family. Idárraga ordered forensic checks and says they pointed to Pegasus, the Israeli spyware. He briefed President Gustavo Petro in mid-December and said he would go public. The figures described around the intrusion are striking. Idárraga said his device faced peaks of up to 3,000 attack attempts per day. The forensic work described 2.3 gigabytes taken from the phone. That amount was compared to about 500,000 emails with attachments. He says the exposure included corruption tips, sensitive government discussions, and private family information. Idárraga initially suggested military counterintelligence structures were involved, using reserved spending. Then Interior Minister Armando Benedetti made a similar claim. He said Pegasus appeared on his phones too. He asked whether agencies hold the tool, or individuals inside the state are using it off the books. Petro ordered police to map the scope of infections. Prosecutors are also involved. Defense Minister Pedro Sánchez, a retired general, has denied that the armed forces or police possess Pegasus. He has questioned a document cited in the dispute, with military sources calling it false. The argument revives an older procurement story.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 23
    },
    {
      "GlobalEventID": "613ad66e5da733eb",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Ukraine’s SBU announced on January 27th that they “detained another FSB agent in the Poltava region. He turned out to be a 40-year-old evader who was hiding from mobilisation and at the same time helped the Rashists shell the central region of Ukraine. It was established that the figure came into the field of view of the occupiers when he published provocative posts in Telegram channels in which he discredited the Defence Forces. After recruitment, he chose an agent pseudonym and secretly began, mainly in the dark, to go around the area and record the locations of Ukrainian troops. Most of the agent’s reconnaissance missions were documented during air alarms near the regional centre, where he tried to detect traffic routes and combat positions of mobile fire groups. With the help of intelligence data, the Rashists hoped to bypass the Ukrainian air defence during a new series of missile and drone attacks on the city. In addition, the FSB hoped to receive from its accomplice information about the bases of training centres (train grounds) of the Armed Forces of Ukraine, on which the enemy was preparing an air strike. SBU documented that the attacker also continued to spread fakes about Ukrainian defenders in Telegram channels. Officers of the Security Service exposed the person involved, gradually documented his crimes and detained him. During the searches, a smartphone with evidence of working for the enemy was seized from him.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 24
    },
    {
      "GlobalEventID": "529d0c96e3a388b4",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Ciber Cuba reported on January 26th that “the intelligence officer Jorge Luis Mayo Fernández, identified for his involvement in espionage and political repression activities , continues to serve as Cuba’s ambassador in Venezuela, despite the allegations linking him to crimes against humanity in several Latin American countries. The diplomat recently participated in an official event at the port of La Guaira, where the 145th anniversary of the arrival of José Martí in Venezuela was commemorated. The event, organized by the Cuban Embassy and local authorities, was attended by the chavista governor José Alejandro Terán and other Venezuelan officials.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 25
    },
    {
      "GlobalEventID": "002dd1c59d4f6a04",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "NPA Syria reported on January 27th that “an Iraqi intelligence official said on Monday that ISIS militants’ numbers in Syria have surged from about 2,000 to nearly 10,000 in just over a year, warning of a renewed threat to Iraq and regional security. Iraqi National Intelligence Service chief Hamid al-Shatri told The Washington Post that many new ISIS recruits include former fighters previously linked to Syrian Transitional President Ahmad al-Sharaa, defectors from other extremist groups, and members of Arab tribes, particularly in Sunni areas that were until recently under Kurdish control. Al-Shatri cautioned that recent security developments in northeast Syria, including unrest at prisons holding thousands of ISIS detainees and the temporary escape of some fighters, have heightened fears of the group’s resurgence. He said Baghdad has deployed thousands of troops and allied armed factions along the Syrian border to prevent infiltration, stressing that ISIS remains “one organization” regardless of geography and will seek to reestablish itself to carry out attacks.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 26
    },
    {
      "GlobalEventID": "60ea56dd37c2d98a",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "AA reported on January 27th that “Somalia’s National Intelligence and Security Agency (NISA) said on Tuesday that it killed a senior al-Shabaab commander in an airstrike targeting the terrorist group in the town of Kuunyo Barrow, in the Lower Shabelle region. The spy agency identified the terrorist as Abdullahi Hassan Abdi Cosoble, also known as “Abdullahi Wadaad,” describing him as al-Shabaab’s chief finance officer. NISA said Wadaad was responsible for overseeing extortion and managing illicit funds extracted from Somali civilians. The operation was carried out in coordination with Somalia’s international security partners, NISA said in a statement. Abdullahi Wadaad also led the group’s so-called “taxation unit” in Lower Shabelle and Banaadir regions, and was “notorious” for abuses against traders and civilians, the statement read. The al-Qaeda-affiliated terrorist group has waged an insurgency against the Somali government for more than 16 years, frequently targeting security forces, officials, and civilians. Since July last year, the Somali army, with the support of the African Union Support and Stabilization Mission in Somalia (AUSSOM) and other international partners, has stepped up operations against al-Shabaab.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 27
    },
    {
      "GlobalEventID": "ba55c7b8d5273fea",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "CNN published this exclusive story on January 27th stating that “the CIA is quietly working to establish a permanent US presence on the ground in Venezuela, spearheading the Trump administration’s plans to exert its newfound influence over the country’s future, according to multiple sources familiar with the planning. Planning discussions between the CIA and State Department have centered around what the US footprint inside Venezuela will look like, both in the short and long term, after the dramatic capture of former President Nicolás Maduro earlier this month. While the State Department will serve as the primary, long-term US diplomatic presence in the country, the Trump administration will likely lean heavily on the CIA to initiate that re-entry process due to the ongoing political transition and unstable security situation in Venezuela post-Maduro, the sources added. “State plants the flag but CIA is really the influence,” one source familiar with the planning process told CNN, noting the agency’s near-term objectives include setting the stage for diplomatic efforts — including relationship building with locals — and providing security. In the short term, US officials may operate out of a CIA annex, prior to the opening of an official embassy, allowing them to start making informal contact with members of different factions of Venezuela’s government as well as opposition figures and target third parties who may be threats, the source said, drawing a parallel to the agency’s work in Ukraine. “Setting up an annex is priority number one. Before diplomatic channels the annex can help set up liaison channels, that will be with the Venezuelan intelligence and that will allow conversations that diplomats cannot have,” said a former US government official who engaged with the Venezuelans. The CIA declined to comment.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 28
    },
    {
      "GlobalEventID": "94d5ba39b6062fbf",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 27th Nelson Amenya stated on X that “last week, I observed how the National Intelligence Service was communicating about their AI hackathon on social media. The intelligence agency that for decades operated exclusively in shadows was now tweeting like a tech startup, encouraging young Kenyans to submit innovative solutions. The book I’d just finished reading came immediately to mind: Hugh Wilford’s *The CIA: An Imperial History*. Wilford documents how America’s intelligence agency inherited techniques from British imperial spycraft. Young CIA officers imagined themselves as T.E. Lawrence figures, deploying covert operations learned from colonial intelligence services. Yet today, the CIA runs public social media accounts. Its 2014 first tweet became viral: “We can neither confirm nor deny that this is our first tweet.” When over 5,600 Kenyans registered for the National Intelligence Research University hackathon, submitting 2,467 proposals, it signaled a change in tactic. NIRU brought in the late General Ogolla’s daughter as a guest speaker, alongside a keynote from MIT. The journey to this moment runs through one pivotal night in November 2002. Wilson Boinnet, then head of Kenya’s intelligence service, drove himself in an unmarked car to a crowded hospital parking lot. Someone picked him up in a battered Peugeot 504 and drove him to President-elect Kibaki’s Muthaiga home. Boinnet had defied his boss, President Moi, establishing secret contact with Kibaki after realizing the opposition would win. When Moi’s advisers pushed to extend his rule, Boinnet informed American officials. A declassified CIA assessment later credited him with professionalizing Kenya’s intelligence arm and steering it away from political repression.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 29
    },
    {
      "GlobalEventID": "1a7528d05cb028bf",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 27th Ukraine’s SBU announced that they “prevented the penetration of an agent of the Belarusian KGB into the units of the Defence Forces of Ukraine. According to the results of a multi-stage special operation in Kyiv, a deeply conspiratorial spy who worked for the KGB of the Republic of Belarus since 2015 was detained. According to the case materials, in 2020 she was seconded from Minsk to work as an agent in Ukraine. At that time, the spy was already in the field of view of the SBU, which was gradually documenting enemy intelligence activity. As the investigation established, the hostile task was performed by a 35-year-old citizen of the Republic of Belarus. She operated under the guise of journalistic activity and for some time worked as a vlaskor of Viktor Medvedchuk’s «112 channel» in the countries of the former USSR. After the closure of Medvedchuk’s resources, the KGB of the Republic of Belarus, with the coordination of the top military and political leadership of Belarus sent an agent to Ukraine. Even before the start of the full-scale war, the figure got a job in one of the leading media of our country. She used this work and the connections of her colleagues in this media to expand personal contacts among Ukrainian politicians, military and foreign diplomats. Already during the full-scale invasion, the handler of the agent instructed her to come to one of the EU countries for additional instruction. The woman crossed the border under the fictitious pretext of a medical examination. To contact the Belarusian intelligence service officer on the territory of the European Union, the person involved purchased a new smartphone with a «disposable» SIM card and after that got rid of the gadget. During the briefing, the spy received the task of collecting information about citizens of the Republic of Belarus/Russia, who are helping Ukraine in the fight against the aggressor state. The agent also received the task from the Belarusian KGB to establish informal contacts with officials of the Embassy of the People’s Republic of China in our country to collect intelligence on the activities of Chinese diplomats in Ukraine. After returning to Kyiv, the agent tried to get a job in one of the headquarters units of the Military Intelligence of our country, where she was involved in the development of the GUR’s own security. Thanks to the timely exposure of the spy, SBU and GUR officers started a long-term operational game with the Belarusian agent, which made it possible not only to document her every step, but also to regularly misinform the Belarusian intelligence service through it. In particular, the forces of the foreign intelligence service were redirected to copy the pretended secret information that circulated around the spy in a controlled manner. Among other things, attempts to select potential candidates for recruitment to the KGB agent apparatus were recorded. Having collected a complete evidence base for the spy, the SBU, in cooperation with the GUR of the Ministry of Defence, detained her near her place of residence. A smartphone and a voice recorder were seized from the figure, on which she recorded secret information.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 30
    },
    {
      "GlobalEventID": "38ca21817713c41b",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "BBC reported on January 25th that “thousands of files provided by a whistleblower at Interpol expose for the first time the extent of Russia’s apparent abuse of the international policing agency to target its critics abroad. The data provided to the BBC World Service and French investigative outlet, Disclose, reveals that Russia is using Interpol’s wanted lists to request the arrest of people such as political opponents, businessmen and journalists, claiming that they have committed crimes. Analysis of data also suggests that over the past decade, Interpol’s own independent complaints unit has received more complaints about Russia than anyone else — three times more than the next highest country, Turkey. In addition, it indicates complaints against Moscow’s requests have led to more cases being overturned than for any other country. After Russia’s full-scale invasion of Ukraine, Interpol introduced extra checks on Moscow’s activity “to prevent any potential misuse of Interpol’s channels in relation to the targeting of individuals within or beyond the conflict in Ukraine”. But the leaked documents suggest these did not prevent Russia abusing the system and the whistleblower told us some stricter measures were quietly dropped in 2025.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 31
    },
    {
      "GlobalEventID": "5131df16e22d588e",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Media Zone reported on January 28th that “the Yaroslavl Regional Court sentenced 39-year-old Nikolai Kharitonov, accused of high treason. The press service of the court reported . According to investigators, from September 2024 to July 2025, the man, on instructions from the Ukrainian intelligence services, transmitted information via messenger about what measures were being introduced in the Yaroslavl region when there was a threat of drone attacks and what air defense systems were there. The court indicated that Kharitonov also left a «discrediting» comment about the Russian military in a channel «controlled by the Ukrainian intelligence services». Along with this sentence, he was sentenced to a year of restriction of freedom after leaving the colony. Judging by Kharitonov’s photograph, which published RIA News, this is one of two residents of the Yaroslavl region whose detention was reported by the FSB reported in August 2025. On the video the man then told the security forces that in May of the same year, «a representative of Ukraine» named Nikolai began communicating with him in a Telegram channel, who «wanted to find out the location of the air defence systems». He promised to pay him in cryptocurrency and help him obtain a passport from a European country.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 32
    },
    {
      "GlobalEventID": "e5e560c49b7f5c89",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 28th that “the exodus from the US intelligence agency continues, fueled by the Trump administration’s staff cutbacks and a growing demand in political risk consulting.” Intelligence Online also stated on X about it that “in the wake of US President Donald Trump’s efforts to scale back intelligence agencies, several CIA veterans have recently moved to the private sector to start new firms to meet the high demand for political risk consulting.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 33
    },
    {
      "GlobalEventID": "b319f86d926ebbf8",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 27th Ukraine’s SBU announced that “according to the evidence base of the Security Service, another agent of the Russian Federation received 15 years in prison with confiscation of property. SBU detained him in January 2025 in Odesa Oblast «on a hot» while he was adjusting an air attack on the region. At the scene, a smartphone containing the coordinates of the Defence Forces facilities on which the Rashists were preparing a missile-drone strike was seized from him. As the investigation established, a 20-year-old resident of the city of Tatarbunary, recruited by Russian intelligence services, was engaged in directing enemy fire. He came to the attention of the Rashists when he was looking for «easy earnings» in specialized Telegram channels. After the agent briefing, he went around the area and looked for the places of greatest concentration of personnel and equipment of the Ukrainian troops in Odesa. Subsequently, the figure expanded his intelligence activity to the neighbouring Mykolaiv region. To do this, he involved a familiar 15-year-old schoolboy from Voznesensk, who leaked the addresses of military facilities to him, including checkpoints and administrative buildings of the TCC. The agent marked the collected intelligence, including that received from the young man, on Google Maps and sent it to the Russian Federation as a messenger.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 34
    },
    {
      "GlobalEventID": "9ec5bb0c7079802c",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Bleeping Computer reported on January 28th that “the coordinated attack on Poland’s power grid in late December targeted multiple distributed energy resource (DER) sites across the country, including combined heat and power (CHP) facilities and wind and solar dispatch systems. Although the attacker compromised operational technology (OT) systems damaging “key equipment beyond repair,” they failed to disrupt power, totalling 1.2 GW or 5% of Poland’s energy supply. Based on public reports, there are at least 12 confirmed affected sites. However, researchers at Dragos, a critical industrial infrastructure (OT) and control systems (ICS) security company say that the number is approximately 30. Researchers at Dragos, a critical industrial infrastructure (OT) and control systems (ICS) security company, published more details about the attack and say that the absence of power outages does not indicate a less concerning incident, but should be seen as a warning about the vulnerability of decentralized energy systems. “An attack on a power grid at any time is irresponsible, but to carry it out in the depths of winter is potentially lethal to the civilian population dependent on it,” reads the Dragos report . “It is unfortunate that those who attack these systems appear to deliberately choose timing that maximizes impact on civilian populations.” Dragos attributes the attack with moderate confidence to a Russian threat actor it tracks as Electrum, which, although it overlaps with Sandworm (APT44), the researchers underline that it is a distinct activity cluster. ESET published a report a few days back about APT44, linking it to failed destructive attacks against Poland’s power grid using malware called DynoWiper . Dragos links Electrum to other wipers deployed against Ukrainian networks, including power-supply units such as Caddywiper and Industroyer2 , noting that the threat group’s operations have recently expanded to more countries. Electrum targeted exposed and vulnerable systems involved in dispatch and grid-facing communication, remote terminal units (RTUs), network edge devices, monitoring and control systems, and Windows-based machines at DER sites.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 35
    },
    {
      "GlobalEventID": "fac6a094b376bded",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "TRT World reported on January 28th that “Iran has executed a man convicted of spying for Israel, Iranian media reported. Hamidreza Sabet Esmailpour, who was arrested on April 29 2025, was hanged after his conviction was confirmed by the Supreme Court, the Iranian judiciary’s media outlet Mizan reported on Wednesday. Esmailpour was accused of espionage and intelligence cooperation with Israel’s intelligence agency Mossad. Iranian authorities alleged he transferred classified documents and sensitive information to an Israeli intelligence officer through covert online communications. According to investigators, a review of his online activities showed he had sent documents directly to an officer linked to Israel. Authorities also accused him of carrying out intelligence and operational activities for Israel, including purchasing equipment for an intelligence officer and transporting vehicles across Isfahan and Lorestan provinces. They alleged these actions were intended to facilitate acts of sabotage targeting Defence Ministry missile facilities.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 36
    },
    {
      "GlobalEventID": "642c161705b68c9a",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Los Angeles Times reported on January 27th that “the photo posted on Facebook last week by a Shasta County flight school shows nine smiling students — all of whom appear to be Asian — posing around a small aircraft. It was meant to celebrate the students, who had recently finished a training program at IASCO Flight Training Inc., on the grounds of the Redding Regional Airport. But in the comments section, an official at a nearby town posted an altered image, with red arrows pointing to each of the students and the words: “China’s Peoples Liberation Army / Redding CA.” Now, school officials say the Jan. 21 remarks by Anderson City Councilmember Darin Hale — who claimed on social media that he was tracking IASCO aircraft and made vague claims of Chinese espionage — have put their students in danger at a time of heightened tensions over immigration. “In the current climate, this type of language creates a tangible safety concern for individuals who live, work, and train in this community,” Miranda Vorhis, the school’s operations manager, wrote in a letter to the Anderson City Council last week. She added: “When such rhetoric comes from an elected official, it does not remain abstract. It legitimizes suspicion, fuels misinformation, and encourages members of the public to view students and educators as targets rather than neighbors.” Hale did not respond to a request for comment.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 37
    },
    {
      "GlobalEventID": "dde176172d0335c6",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hacker News reported on January 28th that “threat actors with ties to China have been observed using an updated version of a backdoor called COOLCLIENT in cyber espionage attacks in 2025 to facilitate comprehensive data theft from infected endpoints. The activity has been attributed to Mustang Panda (aka Earth Preta, Fireant, HoneyMyte, Polaris, and Twill Typhoon) with the intrusions primarily directed against government entities located across campaigns across Myanmar, Mongolia, Malaysia, and Russia. Kaspersky, which disclosed details of the updated malware, said it’s deployed as a secondary backdoor along with PlugX and LuminousMoth infections. “COOLCLIENT was typically delivered alongside encrypted loader files containing encrypted configuration data, shellcode, and in-memory next-stage DLL modules,” the Russian cybersecurity company said . “These modules relied on DLL side-loading as their primary execution method, which required a legitimate signed executable to load a malicious DLL.” Between 2021 and 2025, Mustang Panda is said to have leveraged signed binaries from various software products, including Bitdefender (“qutppy.exe”), VLC Media Player (“vlc.exe” renamed as “googleupdate.exe”), Ulead PhotoImpact (“olreg.exe”), and Sangfor (“sang.exe”) for this purpose. Campaigns observed in 2024 and 2025 have been found to abuse legitimate software developed by Sangfor, with one such wave targeting Pakistan and Myanmar using it to deliver a COOLCLIENT variant that drops and executes a previously unseen rootkit.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 38
    },
    {
      "GlobalEventID": "68841f41ac72d829",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Palestine Chronicle reported on January 28th that “despite Israel’s close ties to some of the world’s most powerful technology firms and cyber warfare units, Israeli Prime Minister Benjamin Netanyahu appears to place limited trust in digital security alone. Recent images circulating on social media show Netanyahu, a wanted war criminal, using both a Samsung phone and an iPhone with their camera lenses carefully covered with adhesive tape. The images, reportedly taken during a phone call and later inside the Knesset, quickly sparked widespread online discussion over the prime minister’s apparent concern about visual surveillance. Observers noted that covering smartphone cameras has become a common security practice among high-risk individuals, including heads of state, senior military officials, intelligence officers, and technology executives, amid growing awareness of remote camera activation and spyware threats.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 39
    },
    {
      "GlobalEventID": "c683d4cd9f2ad4bd",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Turkish Minute reported on January 28th that “a Turkish court has ruled for the arrest of six people, including an Iranian national, who were detained in an operation targeting an alleged espionage network accused of collecting political and military intelligence on behalf of Iran, the state-run Anadolu news agency reported on Wednesday. The National Intelligence Organization (MİT) and the General Directorate of Security carried out coordinated raids in İstanbul and four other provinces as part of the investigation led by the İstanbul Chief Public Prosecutor’s Office. Turkey’s counterterrorism police and intelligence officials said the group was linked to members of the Islamic Revolutionary Guard Corps’ (IRGC) intelligence branch. Prosecutors allege that the suspects gathered information on military bases and strategically important locations in Turkey, as well as critical sites abroad. The group reportedly conducted surveillance activities near İncirlik Airbase and sent intelligence and logistical data to Iranian intelligence services. İncirlik is a Turkish airbase in the southern province of Adana also used by the United States Air Force, which has more than 1,400 airmen there. Prosecutors also claimed the suspects monitored the transfer of armed drones through Turkey to third countries for operational purposes. The suspects were identified as Iranian national Ashkan Jalali and five Turkish citizens: Remzi Beyaz, Alican Koç, Erhan Ergelen, Taner Özcan and Cemal Beyaz. They were detained following simultaneous raids in İstanbul, Van, Samsun, Yalova and Ankara.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 40
    },
    {
      "GlobalEventID": "1925df33fea1f03f",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 28th Ukraine’s SBU announced that “according to the evidence base of counter-intelligence and investigators of the Security Service, another FSB agent who adjusted the Russian air attacks on Mykolaiv and Odesa received 15 years of imprisonment with confiscation of property. As the investigation established, the 65-year-old resident of Mykolaiv, who came into the enemy’s field of vision during trips to the Russian Federation even before the start of the full-scale war, was engaged in directing the shelling. At the end of February 2022, he received a call from an FSB officer via messenger and offered cooperation in exchange for «evacuating» to the aggressor country. Having agreed to the «offer», the traitor began to track and record the locations of repair bases and other logistics centres of the Defence Forces, through which the Rashists were preparing missile and drone attacks. To collect intelligence, the agent drove around the city in his own car and photographed potential «targets», as well as asked his acquaintances from Odesa for information. He dictated the collected information to the handler in voice messages, and used a «separate» smartphone for conspiracy purposes. SBU counter-intelligence officers detained an enemy henchman in September 2024. During the searches, mobile phones with evidence of working for the aggressor were seized from him.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 41
    },
    {
      "GlobalEventID": "676181cdfca43a1b",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Tribune India reported on January 29th that “a National Investigation Agency (NIA) special court at Vishakhapatnam on Tuesday sentenced a key accused in a Pakistan-led espionage conspiracy case, involving fraudulent use of SIM cards and misuse of social media, to simple imprisonment (SI) for a period of five years and six months. The accused, identified as Altafhusen Ghanchibhai, alias Shakil, has been sentenced to SI for a period of five years and six months and fined Rs 5,000 under Section 18 of UA(P)A and to SI of 2.5 years with fine of Rs 5,000 under Section 66C of the IT Act, 2000. The two sentences will run concurrently to the maximum term of 5.5 years. Shakil had pleaded guilty during the ongoing trial, as part of which 37 witnesses had already been examined by the prosecution. Convicting the accused for misusing unique identification features, including SIM cards and OTPs, as well as social media, the special court pronounced its orders against him on January 27. The cross-border conspiracy case involved use of Indian SIM cards belonging to fishermen arrested by the Pakistan Navy during fishing on High Seas. The mobile phones and SIM cards of these fishermen were seized by the Pakistan Navy and later activated by the accused in India to facilitate espionage activities. The NIA investigation into the conspiracy had conclusively established that the accused had inserted the Indian SIM cards in his mobile handset and generated one-time passwords (OTPs), which he had shared with Pakistani Intelligence Operatives (PIOs), enabling operation of Indian WhatsApp numbers from Pakistan.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 42
    },
    {
      "GlobalEventID": "05932ee10d6acd2d",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Odessa Journal reported on January 28th that “the Defence Intelligence Agency of Finland (PVTIEDL) published the “Public Military Intelligence Review 2025,” providing a comprehensive analysis of key security trends, potential threat scenarios, and strategic challenges at both national and global levels. The report notes that following Finland’s accession to NATO, the country has become a significantly higher-priority target for Russian intelligence activities. The report identifies Russia as the primary source of military risks for Finland and Europe, driven by the modernization of its nuclear arsenal and a large-scale armed forces reform. After the conclusion of the Russia-Ukraine war, Moscow is likely to focus on the northwestern strategic direction and accelerate its military transformations. The review also highlights the gradual strengthening of China as a global center of political, economic, and military influence through 2049. Beijing is steadily expanding its military capabilities, particularly in the naval domain, leveraging the fact that Russia’s prolonged war in Ukraine diverts Western strategic attention. The Baltic Sea is identified as one of the key areas of security competition between the West and Russia. The Kremlin combines military activity in the region with risks of sabotage to critical infrastructure and interference with Finland’s navigation systems. The report emphasizes that over 40% of Russia’s foreign trade, including energy resources, passes through the Baltic Sea. The Arctic is also gaining strategic importance as an area of interest for both Russia and China, with Moscow seeking to secure the Northern Sea Route as an international trade corridor. PVTIEDL notes that, in the medium term, the Russia-Ukraine war remains a key factor in constraining Russian military activity in the Baltic region. At the same time, given limited opportunities for direct escalation, Russia is increasingly expected to employ hybrid tools, including sabotage against underwater and port infrastructure and interference with NATO countries’ navigation systems.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 43
    },
    {
      "GlobalEventID": "cfe43e20fa30257b",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hacker News reported on January 28th that “Google on Tuesday revealed that multiple threat actors, including nation-state adversaries and financially motivated groups, are exploiting a now-patched critical security flaw in RARLAB WinRAR to establish initial access and deploy a diverse array of payloads. “Discovered and patched in July 2025, government-backed threat actors linked to Russia and China as well as financially motivated threat actors continue to exploit this n-day across disparate operations,” the Google Threat Intelligence Group (GTIG) said . “The consistent exploitation method, a path traversal flaw allowing files to be dropped into the Windows Startup folder for persistence, underscores a defensive gap in fundamental application security and user awareness.” The vulnerability in question is CVE-2025–8088 (CVSS score: 8.8), which was patched by WinRAR version 7.13 released on July 30, 2025. Successful exploitation of the flaw could allow an attacker to obtain arbitrary code execution by crafting malicious archive files that are opened by a vulnerable version of the program. ESET, which discovered and reported the security defect, said it observed the dual financial and espionage-motivated threat group known as RomCom (aka CIGAR or UNC4895) exploiting the flaw as a zero-day as far back as July 18, 2025, to deliver a variant of the SnipBot (aka NESTPACKER) malware. It’s worth noting that Google is tracking the threat cluster behind the deployment of Cuba Ransomware under the moniker UNC2596.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 44
    },
    {
      "GlobalEventID": "cf351a5bb5957974",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 28th Ukraine’s SBU announced that they “detained three more FSB agents who, on the order of the enemy, committed arson in different regions of Ukraine. A 19-year-old local resident who tried to burn down the building of one of the district councils of the regional centre was exposed in Kropyvnytskyi. SBU officers detained him «on a hot» with a 10-liter canister of gasoline, which he poured on the front door of a municipal institution. As the investigation established, the person involved was recruited by Russian intelligence services through a dating site. There he was answered by a «girl» who immediately offered to meet. However, instead of seeing the young man’s messenger, there was a message that his «acquaintance had allegedly been kidnapped and that in order for her «to be released», he had to burn down the district council. According to a similar scheme, the FSB recruited another resident of the regional centre. He turned out to be a 21-year-old unemployed man who, on the order of the occupiers, tried to destroy the local branch of Ukrposhta with fire. SBU counter-intelligence also detained the perpetrator at the scene of the crime when he poured gasoline and set fire to the front door and window roller shutter of the state facility. In Chernivtsi, a 24-year-old citizen of one of the countries of the Middle East was exposed, who tried to destroy the technological equipment of the supporting electrical substation. To commit the crime, he used 5 liters of gasoline, which he poured near the equipment and tried to set it on fire. SBU counter-intelligence officers detained a foreigner while trying to set fire.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 45
    },
    {
      "GlobalEventID": "cf0e0938b13dffd3",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hill reported on January 28th that “after the fall of Nicolas Maduro, there is was one absolutely clear loser: China. Militarily and politically, they suffered a devastating blow. Despite this, Beijing is not relinquishing its power and presence in Latin America. A military hospital ship and a scientific spy vessel will travel the region this month. Concerns about China are neither unusual nor unfounded. The study “ Surveying the Seas ” by the Center for Strategic and International Studies highlights that China has a dual-use approach to oceanographic research. A clear example of this is that 80 percent of the 64 vessels operating in the Indian Ocean have a military geopolitical agenda. Beijing’s dual strategy is an integral part of civilian infrastructure programs and projects, including the port sector, telecommunications, energy, transportation and military hospital ships like the Silk Road Ark , which is traveling through Latin America. Yes, the same region that the United States declared is “ our hemisphere .” The Silk Road Ark is owned by the People’s Liberation Army Navy. Its tour across the region is part of Mission Harmony 2025–2026. Although its alleged purpose is health care, it also includes joint exercises and other activities with local militaries. The PLA military hospital is visiting 14 countries, including Jamaica, Barbados, Peru, Mexico, Brazil and Chile. The message seems to be very clear: China is here to offer an alternative to the traditional U.S. military partnership.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 46
    },
    {
      "GlobalEventID": "895027e9beb52f0b",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 29th that “the French DGSE foreign intelligence agency has had to shelve its plans to open offices in the Bordeaux metropolitan area in the country’s southwest due to lack of funds.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 47
    },
    {
      "GlobalEventID": "6d3693cc20b5ef82",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Media Zone reported on January 29th that “the Tula Regional Court sentenced 32-year-old Tula resident Davyd V. to 12 and a half years in a maximum security colony on charges of high treason. The press service of the court reported . The court did not provide the full name of the Tula resident; it is hidden in the case file. On the video from the arrest you can hear his patronymic — Arkadyevich. Judging by the list of political prisoners, which draws up the project «Support for Political Prisoners Memorial, we are talking about Davyd Volodin. According to investigators, in April 2022, a man bought cryptocurrency from his card through the application «VTB online» and sent it to an electronic wallet, which «representatives of the Ukrainian intelligence services and the Armed Forces of Ukraine» used to purchase weapons and equipment. Myslo writes , that in total the Tula resident transferred 1.2 thousand rubles. The court was informed that this money went to the needs of the Ukrainian Armed Forces, «Ukrainian nationalist battalions», as well as «far-right and extremist organisations» participating in the war. Volodin was also sentenced to a year of restriction of freedom after leaving the colony. In addition, the court decided to confiscate the phone from which the man transferred money to the state.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 48
    },
    {
      "GlobalEventID": "c278b13f809a725d",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "TASS reported on January 29th that “the Organization for Security and Cooperation in Europe’s (OSCE) Special Monitoring Mission to Ukraine engaged in outright espionage instead of sticking to its intended purpose, Russian Permanent Representative to the OSCE Dmitry Polyansky said. “It is no coincidence that none of the international organizations that had tried to adjust to NATO’s ambition was able to stop the spiral of escalation from unfolding. The OSCE also failed, as its Special Monitoring Mission engaged in outright espionage instead of performing missions of honest verification, and the mediators who represented our common organization in the Minsk process forgot about impartiality and advocated for just one party to the conflict. The responsibility for this lies fully with those who have for years sought to turn the OSCE into a politicized platform that goes against Russia rather than addresses conflicts,” Polyansky noted at a meeting of the OSCE Permanent Council.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 49
    },
    {
      "GlobalEventID": "955b257943f7f664",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Record reported on January 29th that “President Donald Trump’s choice to lead the National Security Agency on Thursday repeatedly defended a mass foreign surveillance power that is weeks away from expiring without congressional action. The testimony by Army Lt. Gen. Joshua Rudd about the importance of Section 702 of the Foreign Intelligence Surveillance Act (FISA) could put him at loggerheads with the commander-in-chief and other national security officials, such as Director of National Intelligence Tulsi Gabbard, who has disparaged the foreign-spying power in the past. “It’s indispensable. I know it’s been critical to mission outcomes, protection of our men and women in harm’s way, and I know it’s saved lives in the homeland,” Rudd, who is also the nominee to helm U.S. Cyber Command, told the Senate Intelligence Committee. “If confirmed, certainly I would do everything I can to provide the best advice as we look to reauthorize or extend this authority,” he later added. FISA gives spy agencies broad authority to collect communications from U.S. technology firms to hunt for national-security threats living overseas but also scoops up an unknown amount of Americans’ communications without a warrant. Congress barely managed to reauthorize the program in 2024, brushing aside last minute objections by then former president Trump himself, who has claimed, without evidence, that it was used to spy on his 2016 campaign. Section 702 is set to expire on April 19 but, thus far, no renewal legislation has been introduced. Congressional and administration officials say that while there have been discussions with the White House about some kind of extension , the decision ultimately rests with Trump himself.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 50
    },
    {
      "GlobalEventID": "b90aef1f87e0c54b",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 29th that “a former French Navy intelligence expert is now running a company based in central France that sells Chinese video surveillance equipment. He promotes intelligent facial recognition systems, for which there is no specific legal framework in France to date.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 51
    },
    {
      "GlobalEventID": "fedd9ec31b2b1a27",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 29th Ukraine’s SBU announced that they “prevented another Russian sabotage at Ukrainian transport infrastructure facilities. As a result of the preemptive actions in Khmelnytskyi region, a minor FSB agent was detained, who was preparing an explosion at the local Ukrzaliznytsia station. As the investigation established, the order of the Russian Federation was carried out by a 16-year-old local resident recruited by the enemy. The occupiers recruited the young man when he was looking for «easy earnings» in Telegram channels after being expelled from the vocational lyceum for academic failure. According to the instructions of the handler from the FSB, the figure first went around the local stations of Ukrzaliznytsia to determine which of them was the most intense traffic. Then, on the task of the handler, he purchased and covertly installed a video camera with remote access for the FSB in front of one of them. In this way, the occupiers hoped to track the time and number of trains heading towards the front regions. The agent then purchased components for the manufacture of an improvised explosive device (IED), which was to be laid near the Ukrzaliznytsia facility for remote detonation. SBU counter-intelligence officers exposed the perpetrator in advance, documented his criminal actions and detained him. During the search, components for the IED and a mobile phone with evidence of work on the FSB were seized from him.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 52
    },
    {
      "GlobalEventID": "30e1d138b7d29c1f",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "JHU Advanced Academic Programs published this lecture on January 28th. As per its description, “join MS in Intelligence Analysis Program Director Michael Ard as he hosts Kevin Riehle, longtime U.S. foreign intelligence analyst and current lecturer in Intelligence and Security Studies at Brunel University of London, for a robust discussion on Russian intelligence operations in the West. Riehle retired in 2021 from a 30+ year career in the U.S. national security community, with tours in the Federal Bureau of Investigation, National Counterintelligence Center, U.S. European Command Joint Analysis Center, DoD Counterintelligence Field Activity, Defense Intelligence Agency, and the Office of the Under Secretary of Defense for Intelligence. He also retired in 2014 as a U.S. Navy Reserve intelligence officer with the rank of commander. During his career, Riehle focused on analyzing foreign intelligence services and supporting counterintelligence activities to neutralize the threats they pose. He finished his career as an associate professor of strategic intelligence at the National Intelligence University, teaching courses and chairing over 40 master’s theses on intelligence, counterintelligence, and Eurasia-related topics. He also served as the department head for the Collection, Analysis and Counterintelligence Department. Riehle earned his PhD in War Studies from King’s College London. He holds an MS in Strategic Intelligence from Joint Military Intelligence College and a BA in Russian and Political Science from Brigham Young University. He also earned a diploma from the Command and Staff Program at U.S. Naval War College.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 53
    },
    {
      "GlobalEventID": "22157aad54bad728",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Caucasian Knot reported on January 28th that “British citizen and English teacher Kuldip Singh has been expelled from Abkhazia after being accused of espionage. Social media users have pointed out the lack of evidence for the charges. The Abkhazian State Security Service detained British citizen Kuldip Singh on suspicion of ties to a foreign intelligence agency. According to the agency, he was developing a project to collect data on Abkhazia’s settlements and military installations. As can be seen in the video, Singh revealed during interrogation that he worked for the London police for 13 years in the intelligence department but resigned due to corruption. He lived in Russia and later came to Abkhazia, where he taught English. According to him, his British passport had expired, which is why he was unable to obtain a visa, according to a video posted on the Abkhazian State Security Service website on January 26. The Sukhumi City Court, after reviewing the evidence presented, ruled that the foreign citizen’s presence in the country was undesirable. Kuldip Singh was officially expelled from Abkhazia through the Ingur checkpoint, Apsnypress reported. The State Security Service and the court have not brought any charges against this man for espionage or other illegal activity. The only formal questions were raised by migration authorities due to document issues. This was precisely the basis for the deportation, Aiashara reported today. “We’re talking about Kali, a man who has lived in Sukhum for many years and is the co-owner of an English language school and a billiard club. He has hundreds of friends, partners, and students. He’s part of the city’s community. And when such a person is publicly called a ‘spy,’ without evidence or a court ruling, it automatically casts a shadow not only on him but on everyone who interacted with him. On the ‘spy’s friends.’ On his students. On his acquaintances. If there is evidence of espionage, society has the right to see it. If not, the question arises: what’s the point of this spectacle?” — the publication says.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 54
    },
    {
      "GlobalEventID": "f88661580c8a2fbf",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Heidoh reported on January 29th that “a former director-general of the Malaysian Defence Intelligence Organisation (MDIO) was charged in the Sessions Court in Kuala Lumpur on 29 January, 2026, with three counts relating to bribery and receiving improper payments linked to his official duties. Razali Alias, 59, pleaded not guilty after the charges were read before judge Suzana Hussin. “I understand the charges. I plead not guilty and request to be tried,” he told the court. According to Malaysian state media Bernama , the first charge alleges that Razali corruptly accepted a bribe of US$20,000 for himself from Sheikh Ahmad Nafiq Sheikh A. Rahman, 45, between August and November 2024. According to the charge, the alleged offence took place at the Malaysian Defence Intelligence Organisation, Kementah Camp, Jalan Padang Tembak, while Razali was serving as director-general. The prosecution said the bribe was offered as an inducement for Razali to approve a certificate of verification and acceptance of services for payment purposes. This approval related to the procurement of maintenance and support services for the Cyber Defence Operations Centre (CDOC) system under the Defence Intelligence Staff Division. The charge is framed under Section 16(a)(B) of the Malaysian Anti-Corruption Commission (MACC) Act 2009 and is punishable under Section 24(1) of the same law. Upon conviction, the offence carries a maximum sentence of 20 years’ imprisonment and a fine of not less than five times the value of the bribe or RM10,000, whichever is higher.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 55
    },
    {
      "GlobalEventID": "ad9e62a614f8c27a",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 29th Ukraine’s SBU announced that “according to the evidence base of the counter-intelligence and investigators of the Security Service, an agent of the Russian Federation who was preparing an air attack by the Rashists on high-voltage power lines (LEP) of the Rivne nuclear power plant received 15 years of imprisonment with confiscation of property. SBU counter-intelligence officers detained the traitor in May 2025, when he tried to install a GPS tracker on one of the main power line supports. According to the available data, according to the coordinates of «beacon», the occupiers planned to hit the energy infrastructure with drones in order to cut off power to part of the northern regions of Ukraine. As the investigation established, the Russian attack was directed by a former employee of the economic support shop at the Rivne NPP recruited by the enemy. According to the case file, the agent initially made covert reconnaissance trips to the perimeter of the high-voltage lines, bypassing the regime facility security posts. Later, according to the instructions of the handler from the Russian Federation, he purchased a GPS tracker and arrived at the power line to install it. During the detention of «on hot», a device and a smartphone with evidence of his contacts with the Russian intelligence service officer were seized from the attacker.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 56
    },
    {
      "GlobalEventID": "e851e2942786f4d6",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Warzone reported on January 29th that “the recent declassification of the United States’ Jumpseat spy satellite provides details on what was previously a highly secretive system, one that monitored critical Soviet military assets during some of the tensest years of the Cold War. While still redacted, the declassification provides never-before-seen imagery of a pioneering system that served the U.S. intelligence community for 35 years. The declassification of certain elements of the Jumpseat program was announced by the director of the National Reconnaissance Office (NRO), the Pentagon intelligence branch responsible for U.S. government reconnaissance satellites. There were eight satellite launches under Jumpseat (also known as AFP-711), between 1971 and 1987, one of them unsuccessful. Developed by the U.S. Air Force as part of the NRO’s Program A, the satellites were carried by Titan IIIB launch vehicles. Based on an original intercontinental ballistic missile (ICBM) design, these rockets lifted off from Vandenberg Air Force Base (now Vandenberg Space Force Base) in California. The NRO confirms the mission numbers 7701 to 7708 for the eight Jumpseat launches. Analysts had previously attempted to match the Jumpseat missions to known space launches out of Vandenberg, although so far only the first and last of these have actually been declassified. There is a possibility that some of the launches normally assessed to involve Jumpseat actually carried other payloads.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 57
    },
    {
      "GlobalEventID": "bc666ed2c12b026c",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Middle East Monitor reported on January 28th that “the United States has sent a secret message to Israel regarding its preparations for a possible attack on Iran, the Israel’s Channel 14 reported. According to the channel, the US message says that preparations for the attack are expected to be completed within about two weeks, and that a suitable opportunity to carry it out could also arise in the coming months. The Americans added that this does not mean they are waiting for the preparations to be completed. From their point of view, the attack could take place even earlier if President Trump were to issue such an order, although this option does not appear to be under consideration at present. However, the United States is currently continuing to strengthen its military forces in the Middle East, in preparation for a possible attack on Iran. There is now a wide and unprecedented deployment of US forces on the ground, giving the American military almost complete freedom to conduct military operations.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 58
    },
    {
      "GlobalEventID": "91da8e6bbd05c32f",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Nordic Monitor reported on January 29th that “a Turkish al-Qaeda–linked cleric who relocated to Syria’s Idlib province to advance jihadist activities has been operating under the protection of Turkey’s National Intelligence Organization (Milli İstihbarat Teşkilatı, MIT), despite an outstanding arrest warrant for him in Turkey, Nordic Monitor has learned. Musa Abu Jafar (also known as Ebu Cafer or Ebu Sumeyye, whose real name is Musa Olgaç) is a Salafist cleric who has long promoted jihadist causes across multiple countries, from Pakistan to Egypt, before ultimately settling in Idlib to continue his activities. A terrorism investigation launched into him in 2011 on allegations of al-Qaeda membership was quietly shelved in 2014 by the Islamist government of President Recep Tayyip Erdogan, after senior police chiefs and prosecutors involved in the case were removed from their posts. According to information obtained by Nordic Monitor, Abu Jafar moved to Syria at the request of MIT, established a base in Idlib province, an area under heavy Turkish military and intelligence control, and expanded his network of followers. His primary audience has consisted of Turkish nationals who traveled to Syria to join jihadist groups as well as sympathizers seeking to establish a sharia-based state in Turkey. Although Abu Jafar regularly posts videos on YouTube and shares ideological messages on X to reach a wider audience, many of his followers travel directly from Turkey to Idlib to meet him in person, receive guidance and attend his sermons. While an arrest warrant remains formally in place, it has never been enforced, serving only as a cosmetic gesture to suggest that the Erdogan government is cracking down on jihadist terrorism.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 59
    },
    {
      "GlobalEventID": "6738a78492192ce1",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Guardian reported on January 28th that “US intelligence agencies disagree with Donald Trump’s newly found opposition to the Chagos deal , Keir Starmer has said, as he underlined how the US administration had supported the deal as it bolstered their defences. The prime minister made his remarks, which could undermine the US president’s fresh view of the deal as an “act of great stupidity”, on the flight to Beijing for a visit that will cover UK national security among other issues. Downing Street sources have told the Guardian the agreement, which was formally approved by Starmer and his Mauritian counterpart last May, is a “done deal” and will not be scuppered by the US. They said the UK government had heard nothing from either the US Department of State or the US intelligence agencies that had led them to believe they had changed their minds — despite Trump’s fiery rhetoric. They suggested the US president’s apparent U-turn — which has been trumpeted by the Tories who oppose the Chagos deal — was linked to his attempts to acquire the strategically important Arctic territory of Greenland. Starmer, asked whether he trusted Trump to honour the commitment he gave in backing the deal last year, told reporters: “I’ve obviously discussed Chagos with Donald Trump a number of times. It has been raised with the White House at the tail end of last week, over the weekend and into the early part of this week. “The position, as you know, is that when the Trump administration came in, we paused for three months to give them time to consider the Chagos deal, which they did at agency level. “Once they’d done that, they were very clear in the pronouncements about the fact that they supported the deal — and they were announcements made by the defence secretary, from memory, Marco Rubio as well, and by president Trump himself.”.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 60
    },
    {
      "GlobalEventID": "a40e84bdcecd321e",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Media Zone reported on January 29th that “the 2nd Western District Military Court sentenced Yaroslav Muratov, a pipe factory worker from the Ryazan region, to 18 years in prison in the case of preparing to set fire to a military registration and enlistment office on One Unity Day. The press service of the court reported . The man will spend the first four years of his sentence in prison, the rest of the term — in a maximum security colony. In addition to imprisonment, he was given a fine of 350 thousand rubles and a year and a half of restriction of freedom. Muratov was found guilty of preparing for a terrorist attack (clause «a» of part 2 of article 205 of the Criminal Code using part 1 of article 30 of the Criminal Code), treason (Article 275 of the Criminal Code), participation in a terrorist attack (part 2 of article 205.4) and teaching terrorism (Article 205.3 of the Criminal Code). According to investigators, a resident of the Ryazan region collaborated with the Ukrainian intelligence services from March 13 to November 3, 2024 — in particular, he transmitted information to them about military facilities in the region. Later, according to a court press release, he made three incendiary devices and hid them in a cache. The prosecution alleged that with their help Muratov wanted to blow up the military registration and enlistment office on November 4, 2024 — National Unity Day. The day before the holiday, the man was detained. According to the list of Rosfinmonitoring, Muratov is 30 years old, he was born in the city of Kasimov in the Ryazan region. Information about him is included in the list «of extremists and terrorists» they did almost immediately after his arrest — November 12, 2024.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 61
    },
    {
      "GlobalEventID": "63f671760d947566",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Reuters published this exclusive story on January 28th stating that “U.S. intelligence reports have raised doubts about whether interim Venezuelan President Delcy Rodriguez will cooperate with the Trump administration by formally cutting ties with U.S. adversaries, four people familiar with the reports said in recent days. U.S. officials have said publicly they want the interim president to sever relations with close international allies like Iran, China and Russia, including expelling their diplomats and advisers from Venezuela. But Rodriguez, whose swearing-in ceremony was attended by representatives of those countries early this month, has yet to publicly announce such a move. She became president after the U.S. captured former Venezuelan President Nicolas Maduro on January 3. The U.S. intelligence reports said it was not clear if she is fully on board with the U.S. strategy in her country, according to the sources, who declined to be identified by name. CIA Director John Ratcliffe traveled on January 15 to Caracas, where he discussed the country’s political future with Rodriguez. Reuters could not determine if those conversations changed the intelligence agencies’ opinion. Washington wants to rein in its foes’ influence in the Western hemisphere, including in Venezuela, where Trump seeks to exploit the OPEC nation’s vast oil reserves. If Rodriguez were to break ties with the U.S. rivals, it would open more opportunity for U.S. investment in Venezuela’s energy sector. But failure to control Rodriguez could undercut Washington’s efforts to direct the country’s interim rulers from afar and avoid a deeper U.S. military role. The Central Intelligence Agency and the Venezuela government did not respond to requests for comment. Asked for comment, a senior Trump administration official, who declined to be identified, said U.S. President Donald Trump “continues to exert maximum leverage” over Venezuela’s leaders and “expects this cooperation to continue.”.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 62
    },
    {
      "GlobalEventID": "f17dc0e81cc277e5",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 30th we added this in our archived content/footage playlist . As per its description, “in May 2025 Russia’s Federal Security Service (FSB) announced that they detained a man, born in 1987 from Kaluga, who was recruited by Ukraine’s intelligence services in September 2023 to identify and report the location of air defence systems to his Ukrainian handler using Telegram messenger. During his arrest, he was tasked to purchase power banks, dry rations, energy drinks, and other material and place them in caches so that Ukrainian sabotage groups could collect them to support their covert operations. According to FSB, he was also provided instructional material by his handler to learn how to use attack drones. In December 2025, the man, now identified as Anatoly Bakhtinov, was sentenced to 13 years in a maximum security prison on charges of high treason.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 63
    },
    {
      "GlobalEventID": "68c21d15cb5dd9a6",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hacker News reported on January 30th that “a former Google engineer accused of stealing thousands of the company’s confidential documents to build a startup in China has been convicted in the U.S., the Department of Justice (DoJ) announced Thursday. Linwei Ding (aka Leon Ding), 38, was convicted by a federal jury on seven counts of economic espionage and seven counts of theft of trade secrets for taking over 2,000 documents containing the tech giant’s trade secrets related to artificial intelligence (AI) technology for the benefit of the People’s Republic of China (PRC). “Silicon Valley is at the forefront of artificial intelligence innovation, pioneering transformative work that drives economic growth and strengthens our national security,” said U.S. Attorney Craig H. Missakian. “We will vigorously protect American intellectual capital from foreign interests that seek to gain an unfair competitive advantage while putting our national security at risk.” Ding was indicted in March 2024 for transferring sensitive proprietary information from Google’s network to his personal Google Cloud account. The stolen documents included details about the company’s supercomputing data center infrastructure used for running AI models, the Cluster Management System (CMS) software for managing the data centers, and the AI models and applications they supported.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 64
    },
    {
      "GlobalEventID": "3f09166379c6a1e0",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Intelligence Online reported on January 30th that “across the globe, spies gather in inconspicuous dens to meet contacts and hold discreet conversations. This week, Intelligence Online visits the BKK Social Club in Thai capital, a favourite haunt for international consultants.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 65
    },
    {
      "GlobalEventID": "94ca18350ed7f9f2",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Times of Israel reported on January 30th that “an Iranian Mossad agent, who was among those on the ground in Iran carrying out preemptive attacks as Israel launched strikes to destroy Iranian nuclear sites last year, described his actions and how he came to work for the spy agency in an interview with Israeli television. The man, whose name was kept secret, spoke to Channel 12’s investigative show “Uvda” for a report aired Thursday evening. He spoke of his motivation in volunteering to become a Mossad agent, visits to Israel, and what happened on June 13, 2025, when Israel hit out at what it said was an immediate, existential threat posed by Iran’s nuclear development program. In the early hours of June 13, as Israeli warplanes were sent to strike Iran, a wave of rocket and drone attacks, launched from within Iran, destroyed key air defense systems, ballistic missile launchers, and targeted senior Iranian military figures, as well as nuclear scientists. The attacks paved the way for the airstrikes that followed, and hampered Iran’s ability to immediately launch a missile and drone counterattack, though those would come in the following days.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 66
    },
    {
      "GlobalEventID": "462a89a074acd38e",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "SWI reported on January 29th that “the Federal Council adopted a revised law on Wednesday and has forwarded it for parliamentary scrutiny. The law governing the Swiss intelligence service has been in force since 2017. But since then, the situation has deteriorated considerably worldwide, including in Switzerland. Since 2020, FIS has been dealing with an increasing number of threats targeting critical infrastructure. The first stage of the review focuses on the early detection of serious threats. To tackle violent extremism, the government wants to extend surveillance powers that are currently available in other areas, such as cases of terrorism. In the event of serious threats, FIZ should be allowed to collect data from banks and other financial service providers to shed light on the financial flows of terrorist organisations or espionage networks. The government also provides details regarding surveillance of the cable network, namely the monitoring of emails, telephone and internet across the Swiss border. The revision of the law will include two further stages. The second package will primarily consist of measures against cyber threats. Consultations are planned for summer 2026. The third stage will address radio and cable network scanning.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 67
    },
    {
      "GlobalEventID": "f5a90277c80de6cd",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "On January 30th Ukraine’s SBU announced that they “prevented new terrorist attacks in Odesa. According to the results of actions in advance, three FSB agents were detained, who were preparing to blow up the cars and homes of Ukrainian soldiers and their families. It was established that the terrorist attacks were supposed to take place due to the remote activation of homemade bombs. In this way, the Rashists hoped not only to eliminate the military, but also to spread panic among the civilian population of Ukraine. According to the Main Directorate of Internal Security and Investigation of the SBU, the main “targets” of the Russian agency were special forces of the Security Service and military personnel of the Armed Forces of Ukraine, who are involved in hostilities on the southern front. At first, the persons involved tracked the residences of Ukrainian defenders and the parking of their cars for a long time. Later, they received the coordinates of the cache from the FSB, from which two improvised explosive devices (IEDs) were taken. The attackers planned to plant both bombs near the entrance to the apartment of two servicemen of the Defence Forces. Then the terrorists had to take the new IED from the hiding places to blow up the cars of the next «targets». SBU officers worked ahead of schedule and detained the persons involved when they were driving to the homes of the Ukrainian military with explosive devices. According to the case materials, the enemy’s tasks were performed by three local FSB agents. A36-year-old evader and two of his accomplices: a deserter and a representative of the NGO for the protection of public order. At the place of detention, IED and smartphones from which they coordinated their actions with the Russian intelligence service were seized from them.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 68
    },
    {
      "GlobalEventID": "4eedf1f7b7558018",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Neptune Prime reported on January 29th that “in 1976, Sam Ogun, a Nigerian freelance journalist, confessed to how he spied on Nigeria for the United States’ Central Intelligence Agency (CIA) for nearly 10 years. He spoke with DRUM magazine. His work began in the early 1960s when he acted as an “information officer” for the American Motion Picture Export Company. His handler, an American film distributor known as Jack, paid him to write reviews of foreign films published in local newspapers and forwarded to New York. That was how he was first placed on a payroll. In 1965, Sam met a new handler, Andrew, a staff member in the political section of the US Embassy in Lagos. They held meetings at secret offices in Victoria Island and Lagos Island. Andrew assigned him tasks: go to the University of Lagos to find out what the students’ union is up to, photograph foreign diplomats and their Nigerian contacts, attend public lectures and record speeches.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 69
    },
    {
      "GlobalEventID": "4c97e1eb925c19a1",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Media Zone reported on January 30th that “the Volgograd Regional Court sentenced 52-year-old local resident Pavel Palekhov to 18 years in a maximum security colony in the case of filming a military unit on instructions of his “handler” from Ukraine. The decision was reported press service of the court and regional prosecutor’s office . Palekhov was found guilty of treason (Article 275 of the Criminal Code). He was sentenced to 18 years in prison, taking into account his previous conviction — in February 2025 they sentenced him to three years in prison in the case of attempted use of dangerous violence against a government official (Part 2 of Article 318 of the Criminal Code with the application of Part 3 of Article 30 of the Criminal Code). According to investigators, a resident of Volgograd «being in disagreement with the political course of the state and the special military operation carried out by the Russian Armed Forces» contacted a representative of the Ukrainian intelligence services through a messenger and agreed on cooperation. The prosecutor’s office claims that on November 13, 2024, Palekhov filmed a military unit in Volgograd using a mobile phone and a quadcopter, but he did not have time to hand over the results of the shooting to his “handler”, since he was detained by security forces. After that the man they arrested me for 10 days, according to the protocol on disobedience to the police (Article 19.3 of the Administrative Code), and then a criminal case was opened and sent to a pre-trial detention centre.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 70
    },
    {
      "GlobalEventID": "8c003d999480c228",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hacker News reported on January 30th that “cybersecurity researchers have discovered a new campaign attributed to a China-linked threat actor known as UAT-8099 that took place between late 2025 and early 2026. The activity, discovered by Cisco Talos, has targeted vulnerable Internet Information Services (IIS) servers located across Asia, but with a specific focus on targets in Thailand and Vietnam. The scale of the campaign is currently unknown. “UAT-8099 uses web shells and PowerShell to execute scripts and deploy the GotoHTTP tool, granting the threat actor remote access to vulnerable IIS servers,” security researcher Joey Chen said in a Thursday breakdown of the campaign. UAT-8099 was first documented by the cybersecurity company in October 2025, detailing the threat actor’s exploitation of IIS servers in India, Thailand, Vietnam, Canada, and Brazil to facilitate search engine optimization (SEO) fraud. The attacks involve infecting the servers with a known malware referred to as BadIIS. The hacking group is assessed to be of Chinese origin, with the attacks dating back to April 2025. The threat cluster also shares similarities with another BadIIS campaign codenamed WEBJACK by Finnish cybersecurity vendor WithSecure in November 2025, based on overlaps in tools, command-and-control (C2) infrastructure, and victimology footprint. The latest campaign is focused on compromising IIS servers located in India, Pakistan, Thailand, Vietnam, and Japan, although Cisco said it observed a “distinct concentration of attacks” in Thailand and Vietnam.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 71
    },
    {
      "GlobalEventID": "c31cb6fcbd5a640e",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Politico reported on January 30th that “the Netherlands’ incoming government wants to push Europe toward a tighter intelligence-sharing club — including what it calls a potential “European equivalent” of the Five Eyes alliance — as part of a broader overhaul of its security services. The new coalition argues, in its governing plans published Friday, that rising threats require faster and more proactive intelligence agencies while preserving the country’s tradition of operating under strict rule-of-law safeguards. The proposals include boosting funding and digital infrastructure for the civilian intelligence agency (AIVD) and military intelligence service (MIVD), and strengthening the role of the national counterterrorism coordinator. At the European level, The Hague says it wants to intensify cooperation with a core group of like-minded countries, explicitly floating a continent-wide version of the “Five Eyes” intelligence partnership (which is made up of Australia, Canada, New Zealand, the U.K., and the U.S.).”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 72
    },
    {
      "GlobalEventID": "7100ed876bf5efd8",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Middle East Monitor reported on January 29th that “the head of Israel’s Military Intelligence Directorate (Aman) visited Washington this week to brief US officials on intelligence assessments related to Iran, Israeli media reported Thursday. Israel’s Channel 12 said Maj. Gen. Shlomi Binder traveled to the US capital to provide the administration of President Donald Trump with specific intelligence it had requested regarding Iran. Citing unnamed American officials, the broadcaster said Binder held a series of meetings on Tuesday and Wednesday with senior figures at the Pentagon, the Central Intelligence Agency and the White House. According to a source familiar with the visit, the discussions focused on intelligence evaluations concerning Iran, as Washington steps up military preparedness amid rising regional tensions. The report said Trump has ordered a reinforcement of the US military presence in the Gulf, as preparations continue for potential scenarios involving Iran. In recent days, Israel has placed its military on heightened alert, amid concerns that any US military action against Iran could prompt retaliatory strikes targeting Israeli interests. Channel 12 quoted White House officials as saying that Trump has yet to make a final decision, despite renewing threats against Iran on Wednesday and warning that any future strikes would be “more severe” than previous ones. At the same time, the report said Trump’s aides have indicated that the US president remains open to diplomatic options, even as military readiness continues.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 73
    },
    {
      "GlobalEventID": "ca2b9b9693afaf33",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Ukraine’s SBU announced on January 30th that “according to the evidence base of the Security Service investigators, another Russian agent received 15 years of imprisonment with confiscation of property. SBU exposed him for committing sabotage in the Dnipropetrovsk region in July 2025. As the investigation established, the attacker was engaged in setting fire to the relay cabinets of Ukrzaliznytsia and tried to let «under the slope» of the freight train. Using the agent’s subversive activities, the Rashists hoped to disrupt transport logistics through the front-line region of Ukraine. According to the case materials, the enemy’s task was performed by a 25-year-old track assembler of the regional branch of Ukrzaliznytsia, who was recruited by the occupiers through the Telegram channel to search for «easy earnings». After being briefed by a handler from the Russian Federation, the traitor began tracking potential «targets» for arson. He then purchased a flammable compound, which he used to destroy two relay cabinets and a transformer on a local rail line. Subsequently, the agent was given the following task — to cause a train crash using the so-called «shoe», which he had to install on the track while the freight echelon was moving. SBU officers prevented this and detained the agent on the eve of the planned sabotage. During the searches, a smartphone with evidence of working for the enemy was seized from him, as well as fuel canisters, which he used to destroy relay cabinets.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 74
    },
    {
      "GlobalEventID": "1a9a34684293f49e",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "HRANA reported on January 29th that “yesterday, January 28, Ahmad Alizadeh, a high school physical education teacher in Abdanan County, was arrested by agents of the Islamic Revolutionary Guard Corps Intelligence in Ilam Province and transferred to an undisclosed location. A source close to the family confirmed the arrest, telling HRANA that Ahmad Alizadeh was detained on Wednesday evening, January 28, 2026, by IRGC intelligence agents without the presentation of a judicial warrant. Following his arrest, he was transferred to an unknown location and has had no contact with his family so far. As of the time of this report, no information has been obtained regarding the reasons for his arrest or the charges brought against him. In February 2025, Ahmad Alizadeh had been sent to the city of Fanuj in Sistan and Baluchestan Province to serve a two-year sentence of compulsory residence. He was previously arrested on October 17, 2022, in connection with the nationwide protests in Abdanan, Ilam Province, by security forces, and was later released on bail.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 75
    },
    {
      "GlobalEventID": "158f5d819b7f1752",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Media Zone reported on January 30th that “Prosecutor’s Office of the Krasnodar Territory reported on the completion of the investigation into the case against two residents of the Anapa region, accused of setting fire to railway equipment on instructions from the Ukrainian intelligence services. Kuban residents aged 24 and 26 years are accused of treason (Article 275 of the Criminal Code), sabotage (Part 2 of Article 281 of the Criminal Code) and money laundering (Part 3 of Article 174.1 of the Criminal Code). The case materials were transferred for consideration to the Krasnodar Regional Court. According to investigators, between April 29 and September 30, 2024, the defendants set fire to three railway infrastructure facilities between stations «Anapa — Gostagaevskaya» and damaged a relay cabinet in the village of Gorny, Novorossiysk region. Security officials claim that the residents of Kuban acted on instructions from the Armed Forces of Ukraine — for arson they received a reward in cryptocurrency, which they subsequently converted into rubles and transferred to their bank account. The exact amount of remuneration is not reported in the press release of the prosecutor’s office. The names of the defendants in the case are unknown. The preliminary investigation into the case was carried out by officers of the regional department of the FSB.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 76
    },
    {
      "GlobalEventID": "a7a6c01d21931e60",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Al Jazeera reported on January 30th that “South Africa is expelling Israel’s envoy to the country, the foreign affairs ministry announced, accusing the Israeli official of engaging in “unacceptable violations of diplomatic norms” that challenge South African sovereignty. The Department of International Relations and Cooperation said on Friday that it was giving Ariel Seidman, the charge d’affaires at the Israeli embassy, 72 hours to leave South Africa after declaring him persona non grata. It accused Seidman of launching “insulting attacks” against South African President Cyril Ramaphosa on social media as well as “a deliberate failure” to inform the ministry “of purported visits by senior Israeli officials”. “Such actions represent a gross abuse of diplomatic privilege and a fundamental breach of the Vienna Convention. They have systematically undermined the trust and protocols essential for bilateral relations,” the department said in a statement . “We urge the Israeli Government to ensure its future diplomatic conduct demonstrates respect for the Republic and the established principles of international engagement.” The announcement drew a rapid response from the Israeli Ministry of Foreign Affairs, which said it had declared senior South African diplomat, Shaun Edward Byneveldt, persona non grata and was giving him 72 hours to leave the country. “Additional steps will be considered in due course,” the Israeli ministry said in a statement shared on social media. Byneveldt is South Africa’s ambassador to the State of Palestine, working out of an office in Ramallah in the occupied West Bank, according to a South African government website .”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 77
    },
    {
      "GlobalEventID": "121a7d0da20636f2",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Hacker News reported on January 31st that “a Farsi-speaking threat actor aligned with Iranian state interests is suspected to be behind a new campaign targeting non-governmental organizations and individuals involved in documenting recent human rights abuses. The activity , observed by HarfangLab in January 2026, has been codenamed RedKitten. It’s said to coincide with the nationwide unrest in Iran that began towards the end of 2025, protesting soaring inflation, rising food prices, and currency depreciation. The ensuing crackdown has resulted in mass casualties and an internet blackout . “The malware relies on GitHub and Google Drive for configuration and modular payload retrieval, and uses Telegram for command-and-control,” the French cybersecurity company said. What makes the campaign noteworthy is the threat actor’s likely reliance on large language models (LLMs) to build and orchestrate the necessary tooling. The starting point of the attack is a 7-Zip archive with a Farsi filename that contains macro-laced Microsoft Excel documents. The XLSM spreadsheets claim to include details about protesters who died in Tehran between December 22, 2025, and January 20, 2026. But embedded within each of them is a malicious VBA macro, which, when enabled, functions as a dropper for a C#-based implant (“AppVStreamingUX_Multi_User.dll”) by means of a technique called AppDomainManager injection . The VBA macro, for its part, shows signs of being generated by an LLM due to the “overall style of the VBA code, the variable names and methods” used, as well as the presence of comments like “PART 5: Report the result and schedule if successful.” The attack is likely an effort to target individuals who are looking for information about missing persons, exploiting their emotional distress to provoke a false sense of urgency and trigger the infection chain. Analysis of the spreadsheet data, such as mismatched ages and birthdates, suggests it’s fabricated.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 78
    },
    {
      "GlobalEventID": "f1df665b4d34f47c",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "The Washington Examiner reported on January 29th that “an American ally and Sunni Arab monarchy, the United Arab Emirates is often praised by conservatives for its robust policy toward Islamist extremist movements and cooperation with Israel. There’s no question that the UAE is an important ally. It has made massive investments in the U.S. economy, especially since President Donald Trump’s return to office . It also provides important counterterrorism cooperation and support for the U.S. military in the Middle East. It should also be noted that the UAE was also disrespected by the Biden and Obama administrations, both of which neglected the Arab values of trust and reliability among friends. This record means that the UAE is often contrasted with Qatar, which exists both as an American ally and as a key source of funding for Islamic extremists and terrorists. Qatar is, put simply, a very problematic ally. Still, the UAE is far from a perfect American partner. The kingdom has too long treated its robust counterterrorism activities as a blank check for anti-American activities in other areas. The UAE remains far too close to China for a privileged American ally. A mix of three active and former U.S. government sources has told the Washington Examiner that the UAE has provided Russia with the identities of U.S. intelligence officers. The UAE also remains a global safe haven for organized crime groups and corrupt officials. Finally, this union of seven Islamic emirates has supported destabilizing groups in Sudan and Yemen. The UAE’s relationship with Russia and China runs deep.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 79
    },
    {
      "GlobalEventID": "5e710486571ed4c1",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "WION reported on January 31st that “twin explosions occurred in southern Iran on Saturday amid escalation in tensions as fears of war loom following warnings of military action and sharp reactions by Washington and Tehran. One explosion occurred at Iran’s southern port of Bandar Abbas, confirmed Iranian media reports without revealing the cause for the blast. Iran’s state television said the explosion occurred at an eight-story building, “destroying two floors, several vehicles, and shops” in Moallem Boulevard area of the city. Images carried by state TV showed the building’s facade blown out, exposing parts of its interior, with debris scattered around. One person was killed, and 14 were reportedly injured in the blast. The port of Bandar Abbas lies on the Strait of Hormuz, a crucial waterway between Iran and Oman that handles a fifth of the world’s seaborne oil. The authorities in Iran rejected reports alleging that a Revolutionary Guard navy commander was targeted and killed in the explosion. Several Telegram channels had circulated claims that Rear Admiral Alireza Tangsiri, commander of the Islamic Revolutionary Guard Corps (IRGC) Navy, was targeted in the assassination. The semi-official Tasnim news agency said that social media reports alleging that a Revolutionary Guard navy commander was targeted in the explosion were “completely false”. The Director General of Crisis Management in Hormozgan province said a loud blast heard in parts of Bandar Abbas was caused by an explosion at a residential home on Moallem Boulevard and was not related to any other incidents.”",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 80
    },
    {
      "GlobalEventID": "40d7aee0fbdec382",
      "Day": "2026-01-25/2026-01-31",
      "SourceCollection": "Medium",
      "SourceCommonName": "The Spy Collection",
      "DocumentIdentifier": "SPY_NEWS_2026_W5",
      "EventText": "Weekly summaries of all published espionage-related news stories. For inquiries please use: info@spycollection.org",
      "Actor1Name": null,
      "Actor1Type": "INTEL",
      "Actor2Name": null,
      "Actor2Type": null,
      "ActionCategory": "ESPIONAGE",
      "ActionDetail": null,
      "Country": null,
      "Confidence": 0.3,
      "ParagraphIndex": 83
    }
  ]
}